{
    "text": "## Can I upgrade or downgrade my plan at any time?\nYes, you can adjust your plan at any time to better suit your needs. Upgrades will take effect immediately, while downgrades will be applied at the start of your next billing cycle.\n\n## Do you offer a free trial for any of the plans?\nYes, you can adjust your plan at any time to better suit your needs. Upgrades will take effect immediately, while downgrades will be applied at the start of your next billing cycle.\n\n## Can I import my existing data from TeslaFi or my self-hosted TeslaMate?\nWe can import your existing data following these 3 steps:\n1. Backup your existing data from TeslaFi or TeslaMate.\n2. Upload your backup to wetranfer and get link\n3. Click here to open the chat and paste the wetranfer link so that we can import this data about your environmen.\n\nNote: You must have an active MyTeslaMate subscription to be able to import your data.\n\n## How long is my Tesla data retained?\nAs long as your MyTeslaMate subscription is activated, data will be retained:\nThere is no limit to the duration of your subscription\nYou can download your data at any time from https://app.myteslamate.com\n\n## How do I recover a backup of my TeslaMate?\nFrom app.myteslamate.com, you can download a backup of your TeslaMate.\n\n## How do we guarantee the security of your data and your TeslaMate?\nOur installations are made according to the rules of the art and allow you to avoid bad configurations to guarantee the security of your data: updates each release after a few days firewall and WAF, daily backups\n\n## Where do we host the data?\nAll our customers’ data is hosted in Europe. No data is used / sent to foreign countries.\nDaily backups and hosting are located in different countries.\n\n## How long does it take to launch MyTeslaMate and see the full graphs?\nAfter paying for your subscription, your own TeslaMate instance and Grafana organization will be available immediately.\nFrom the moment you link your Tesla account to TeslaMate, data starts populating your TeslaMate instance.\nIn order to display all graphs, at least two charging sessions and a car ride.are required.",
    "title": "FAQ MyTeslamate",
    "article_id": "0000002",
    "url": "https://www.myteslamate.com/pricing/#faq"
}